InformationRegisters/Лео_СкладQRКоды_ВведеноВОборот/Лео_СкладQRКоды_ВведеноВОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_СкладQRКоды_ВведеноВОборот</name>
  <resources>
    <name>GTIN</name>
    <type>
      <types>CatalogRef.Лео_СправочникGTIN_ПодлежащихМаркировки</types>
    </type>
  </resources>
  <resources>
    <name>id_orders</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_korob</name>
    <type>
      <types>CatalogRef.Лео_СправочникШтрихКодовКоробок</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияКодов</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КодСчитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодОтгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Код_КМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>85</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Catalogs/Лео_СправочникШтрихКодовКоробок/Лео_СправочникШтрихКодовКоробок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Лео_СправочникШтрихКодовКоробок</name>
  <attributes>
    <name>Паллета_id</name>
    <comment>код паллеты если коробка агрегирована</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>статус (вложенность)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

CommonModules/Лео_ЗагрузкаКодовЧЗ/Module.bsl
Процедура НачатьЗагрузкуДаннухЧЗ() Экспорт

	//Инициализация переменных
	//ИмяСервераSQL = "ASUMT";
    ИмяСервераSQL = "COMP234B\SQLENTERPRISE";
    ПользовательSQL = "diar";
    ПарольSQL = "64784222";
    БазаДанныхSQL = "crux_prom";
    ТаблицаСерий = "";
    ТаблицаSQL = "";
	/////////////////////////////////////////
    //Подключение к SQL-серверу
    Попытка
        Соединение  = Новый COMОбъект("ADODB.Connection");
        Команда     = Новый COMОбъект("ADODB.Command");
        //Выборка     = Новый COMОбъект("ADODB.RecordSet");
        Соединение.ConnectionString =
            "driver={SQL Server};" +
            "server="+ИмяСервераSQL+";"+
            "uid="+ПользовательSQL+";"+
            "pwd="+ПарольSQL+";"+
            "database="+БазаДанныхSQL+";";
        Соединение.ConnectionTimeout = 30;
        Соединение.CommandTimeout = 600;
        //Открытие соединение
        Соединение.Open();
        Команда.ActiveConnection   = Соединение;
		ВывестиСообщение("Успешное подключение!");
    Исключение
        ВывестиСообщение(ОписаниеОшибки());
        Возврат;
	КонецПопытки;
	
	//обработки справочников 
	ВывестиСообщение("1. "+ТекущаяДата());
	ЗагрузитьСправочникКоробки(Команда);
	ВывестиСообщение("2. "+ТекущаяДата());
	ЗагрузитьСправочникПродукцииПодлежащейМаркировки(Команда);
	ВывестиСообщение("3. "+ТекущаяДата());
	ЗагрузкаКодовЧЗ(Команда);
	/////////////////////////////////////////
    //Закрытие соединения
	ВывестиСообщение("окончание "+ТекущаяДата());
   Попытка
        Соединение.Close();
		//Сообщить("Соединение закрыто!");
    Исключение
        ВывестиСообщение(ОписаниеОшибки());
    КонецПопытки;
	
КонецПроцедуры  

Процедура ЗагрузитьСправочникКоробки(Команда)  
	
	///////////////////////////////////////
    //Читаем записи
    ТекстИнструкции = "SELECT [id]
    |  ,[km]
    |  ,[parent_id]
    |  ,[status]
  	|	FROM [crux_prom].[dbo].[korob]
	|	WHERE status>0";  
	
	КЧ = Новый КвалификаторыЧисла(9,0);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧисло	=	Новый ОписаниеТипов(Массив, , ,КЧ);
	ТаблицаКодовКоробки	=	Новый ТаблицаЗначений;
	ТаблицаКодовКоробки.Колонки.Добавить("id",ОписаниеТиповЧисло);
	ТаблицаКодовКоробки.Колонки.Добавить("Паллета_id",ОписаниеТиповЧисло);

	КЧ = Новый КвалификаторыЧисла(1,0);
	ОписаниеТиповЧисло	=	Новый ОписаниеТипов(Массив, , ,КЧ);
	ТаблицаКодовКоробки.Колонки.Добавить("Статус",ОписаниеТиповЧисло);
	
	КС = Новый КвалификаторыСтроки(20);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока	=	Новый ОписаниеТипов(Массив, , ,КС);
	ТаблицаКодовКоробки.Колонки.Добавить("Штрих_код",ОписаниеТиповСтрока);
	
	Попытка
		Команда.CommandText = ТекстИнструкции;
        Выборка = Команда.Execute();
		Если Выборка.EOF() = 0 Тогда 
			Данные = Выборка.GetRows().Выгрузить();
			Для Каждого Стр Из Данные Цикл 
				НовСтрТЗ	=	ТаблицаКодовКоробки.Добавить();
				НовСтрТЗ.id 		= Число(Стр[0]);
				НовСтрТЗ.Штрих_код	= Строка(Стр[1]);
				НовСтрТЗ.Паллета_id	= Число(Стр[2]);
				НовСтрТЗ.Статус		= Число(Стр[3]); 
				Если НовСтрТЗ.Статус=5 Тогда
	ВывестиСообщение(НовСтрТЗ.Штрих_код);
				КонецЕсли	
			КонецЦикла;
		КонецЕсли;
	
		Запрос	=	Новый Запрос;
		Запрос.Текст	=	"ВЫБРАТЬ
		            	 	|	ТаблицаКодовКоробки.id,
		            	 	|	ТаблицаКодовКоробки.Штрих_код,
		            	 	|	ТаблицаКодовКоробки.Паллета_id,
		            	 	|	ТаблицаКодовКоробки.Статус
		            	 	|ПОМЕСТИТЬ ВнутренняяТаблицаКоробки
		            	 	|ИЗ
		            	 	|	&ТаблицаКодовКоробки КАК ТаблицаКодовКоробки
		            	 	|;
		            	 	|
		            	 	|////////////////////////////////////////////////////////////////////////////////
		            	 	|ВЫБРАТЬ
		            	 	|	ВнутренняяТаблицаКоробки.id,
		            	 	|	ВнутренняяТаблицаКоробки.Штрих_код,
		            	 	|	Лео_СправочникШтрихКодовКоробок.Код,
		            	 	|	Лео_СправочникШтрихКодовКоробок.Наименование,
		            	 	|	ВнутренняяТаблицаКоробки.Паллета_id,
		            	 	|	Лео_СправочникШтрихКодовКоробок.Паллета_id КАК Паллета_код,
		            	 	|	ВЫБОР
		            	 	|		КОГДА ВнутренняяТаблицаКоробки.id = Лео_СправочникШтрихКодовКоробок.Код
		            	 	|			ТОГДА ИСТИНА
		            	 	|		ИНАЧЕ ЛОЖЬ
		            	 	|	КОНЕЦ КАК КодДобавлен,
		            	 	|	ВЫБОР
		            	 	|		КОГДА ВнутренняяТаблицаКоробки.Штрих_код = Лео_СправочникШтрихКодовКоробок.Наименование
		            	 	|			ТОГДА ЛОЖЬ
		            	 	|		ИНАЧЕ ИСТИНА
		            	 	|	КОНЕЦ КАК КодИзменен,
		            	 	|	ВЫБОР
		            	 	|		КОГДА ВнутренняяТаблицаКоробки.Паллета_id = Лео_СправочникШтрихКодовКоробок.Паллета_id
		            	 	|			ТОГДА ЛОЖЬ
		            	 	|		ИНАЧЕ ИСТИНА
		            	 	|	КОНЕЦ КАК КодПаллетыДобавлен,
		            	 	|	Лео_СправочникШтрихКодовКоробок.Ссылка,
		            	 	|	ВнутренняяТаблицаКоробки.Статус
		            	 	|ПОМЕСТИТЬ ВыгрузитьШтрихКоды
		            	 	|ИЗ
		            	 	|	ВнутренняяТаблицаКоробки КАК ВнутренняяТаблицаКоробки
		            	 	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лео_СправочникШтрихКодовКоробок КАК Лео_СправочникШтрихКодовКоробок
		            	 	|		ПО ВнутренняяТаблицаКоробки.id = Лео_СправочникШтрихКодовКоробок.Код
		            	 	|;
		            	 	|
		            	 	|////////////////////////////////////////////////////////////////////////////////
		            	 	|ВЫБРАТЬ
		            	 	|	ВыгрузитьШтрихКоды.id,
		            	 	|	ВыгрузитьШтрихКоды.Штрих_код,
		            	 	|	ВыгрузитьШтрихКоды.Паллета_id,
		            	 	|	ВыгрузитьШтрихКоды.Статус,
		            	 	|	ВыгрузитьШтрихКоды.Ссылка,
		            	 	|	ВыгрузитьШтрихКоды.КодДобавлен,
		            	 	|	ВыгрузитьШтрихКоды.КодИзменен,
		            	 	|	ВыгрузитьШтрихКоды.КодПаллетыДобавлен
		            	 	|ИЗ
		            	 	|	ВыгрузитьШтрихКоды КАК ВыгрузитьШтрихКоды
		            	 	|ГДЕ
		            	 	|	(НЕ ВыгрузитьШтрихКоды.КодДобавлен
		            	 	|			ИЛИ ВыгрузитьШтрихКоды.КодИзменен
		            	 	|			ИЛИ ВыгрузитьШтрихКоды.КодПаллетыДобавлен)";

		//Передаем таблицу	
		Запрос.УстановитьПараметр("ТаблицаКодовКоробки",ТаблицаКодовКоробки);
		ВыгрузкаЗапрос	=	Запрос.Выполнить().Выгрузить();
		ВыборкаЗапрос	=	Запрос.Выполнить().Выбрать();
		ВывестиСообщение("Связка таблиц  "+ТекущаяДата());
	
		Пока ВыборкаЗапрос.Следующий() Цикл
			Если НЕ ВыборкаЗапрос.КодДобавлен Тогда
				НоваяСтрока	=	Справочники.Лео_СправочникШтрихКодовКоробок.СоздатьЭлемент();
				НоваяСтрока.Код				=	ВыборкаЗапрос.id;
				НоваяСтрока.Наименование	=	ВыборкаЗапрос.Штрих_код;
				НоваяСтрока.Паллета_id		=	ВыборкаЗапрос.Паллета_id;
				НоваяСтрока.Статус			=	ВыборкаЗапрос.Штрих_код;
				НоваяСтрока.Записать();
			Иначе
				Если ВыборкаЗапрос.КодИзменен ИЛИ ВыборкаЗапрос.КодПаллетыДобавлен Тогда 
					СтрокаОбъект	=	ВыборкаЗапрос.Ссылка.ПолучитьОбъект();
					СтрокаОбъект.Код			=	ВыборкаЗапрос.id;
					СтрокаОбъект.Наименование	=	ВыборкаЗапрос.Штрих_код;	
					СтрокаОбъект.Паллета_id		=	ВыборкаЗапрос.Паллета_id;	
					СтрокаОбъект.Статус			=	ВыборкаЗапрос.Статус;	
					СтрокаОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
	    КонецЦикла;
    
    Исключение
        ВывестиСообщение(ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

Процедура ЗагрузитьСправочникПродукцииПодлежащейМаркировки(Команда)  
	
    ///////////////////////////////////////
    //Читаем записи
    ТекстИнструкции = "SELECT [id]
    |  ,[name]
    |  ,[kod]
	|  FROM [crux_prom].[dbo].[gtin]";
    
    Попытка
        Команда.CommandText = ТекстИнструкции;
        Выборка = Команда.Execute();
        Если Выборка.BOF = Ложь Тогда
            Выборка.MoveFirst();
			Пока Выборка.EOF = Ложь Цикл   
				НайденнаяСсылка=Справочники.Лео_СправочникGTIN_ПодлежащихМаркировки.НайтиПоНаименованию(СокрЛП(Строка(Выборка.Fields("kod").Value)));
				Если НайденнаяСсылка=Справочники.Лео_СправочникGTIN_ПодлежащихМаркировки.ПустаяСсылка() Тогда
				
					НоваяСтрока	=	Справочники.Лео_СправочникGTIN_ПодлежащихМаркировки.СоздатьЭлемент();
					НоваяСтрока.Код				=	Число(Выборка.Fields("id").Value);
					НоваяСтрока.Наименование	=	Строка(Выборка.Fields("kod").Value);
					НоваяСтрока.НаименованиеЧЗ	=	Строка(Выборка.Fields("name").Value);
					НоваяСтрока.Записать();
					
				КонецЕсли;
                
                Выборка.MoveNext();  
            КонецЦикла;
        КонецЕсли;
    Исключение
        ВывестиСообщение(ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

Процедура ЗагрузкаКодовЧЗ(Команда)	
	
    ///////////////////////////////////////
    //Читаем записи
    ТекстИнструкции = "SELECT [id]
	|	,[kod_KM]
	|	,[gtin]
	|	,[id_orders]
	|	,[date_receiving]
	|	,[printtt]
	|	,[date_print]
	|	,[scanner]
	|	,[date_scanner]
	|	,[id_report_application]
	|	,[id_report_aggregation]
	|	,[id_korob]
	|	,[id_report_brak]
	|	,[brak]
	|	,[id_report_putting]
	|	,[scan_from_additional_devices]
	|	FROM [crux_prom].[dbo].[sklad]
	|   Where [date_receiving]>='2023-09-01'";
                          
	КЧ = Новый КвалификаторыЧисла(9,0);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧисло	=	Новый ОписаниеТипов(Массив, , ,КЧ);
	ТаблицаКодовЧЗ	=	Новый ТаблицаЗначений;
	ТаблицаКодовЧЗ.Колонки.Добавить("id",ОписаниеТиповЧисло);
	ТаблицаКодовЧЗ.Колонки.Добавить("id_коробки",ОписаниеТиповЧисло);
	
	КЧ = Новый КвалификаторыЧисла(1,0);
	ОписаниеТиповЧисло	=	Новый ОписаниеТипов(Массив, , ,КЧ);
	ТаблицаКодовЧЗ.Колонки.Добавить("КодСчитан",ОписаниеТиповЧисло);
	
	КС = Новый КвалификаторыСтроки(85);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока	=	Новый ОписаниеТипов(Массив, , ,КС);
	ТаблицаКодовЧЗ.Колонки.Добавить("QR_код",ОписаниеТиповСтрока);
	
	КС = Новый КвалификаторыСтроки(14);
	ОписаниеТиповСтрока	=	Новый ОписаниеТипов(Массив, , ,КС);
	ТаблицаКодовЧЗ.Колонки.Добавить("GTIN",ОписаниеТиповСтрока);
	
	КС = Новый КвалификаторыСтроки(6);
	ОписаниеТиповСтрока	=	Новый ОписаниеТипов(Массив, , ,КС);
	ТаблицаКодовЧЗ.Колонки.Добавить("id_orders",ОписаниеТиповСтрока);

	КД = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	ОписаниеТиповДата	=	Новый ОписаниеТипов(Массив, , ,КД);
	ТаблицаКодовЧЗ.Колонки.Добавить("Дата_ПолученияКодов",ОписаниеТиповДата);
	
    Попытка
		Команда.CommandText = ТекстИнструкции;
        Выборка = Команда.Execute();
		Если Выборка.EOF() = 0 Тогда 
			Данные = Выборка.GetRows().Выгрузить();
			Для Каждого Стр Из Данные Цикл 
				НовСтрТЗ	=	ТаблицаКодовЧЗ.Добавить();
				НовСтрТЗ.id 		= Число(Стр[0]);
				НовСтрТЗ.id_коробки	= Число(Стр[11]);
				НовСтрТЗ.QR_код		= Строка(Стр[1]);
				НовСтрТЗ.GTIN		= Строка(Стр[2]);
				НовСтрТЗ.id_orders	= Строка(Стр[3]);
				НовСтрТЗ.КодСчитан	= Число(Стр[7]);
				НовСтрТЗ.Дата_ПолученияКодов	= Дата(Стр[4]);
				
			КонецЦикла;
		КонецЕсли;
		ВывестиСообщение("Создана временная таблица "+ТекущаяДата());
		Запрос	=	Новый Запрос;
		Запрос.Текст	=	"ВЫБРАТЬ
		            	 	|	ТаблицаКодовЧЗ.id,
		            	 	|	ТаблицаКодовЧЗ.id_коробки,
		            	 	|	ТаблицаКодовЧЗ.QR_код,
		            	 	|	ТаблицаКодовЧЗ.GTIN,
		            	 	|	ТаблицаКодовЧЗ.id_orders,
		            	 	|	ТаблицаКодовЧЗ.КодСчитан,
		            	 	|	ТаблицаКодовЧЗ.Дата_ПолученияКодов
		            	 	|ПОМЕСТИТЬ ВнутренняяТаблицаСклад
		            	 	|ИЗ
		            	 	|	&ТаблицаКодовЧЗ КАК ТаблицаКодовЧЗ
		            	 	|;
		            	 	|
		            	 	|////////////////////////////////////////////////////////////////////////////////
		            	 	|ВЫБРАТЬ
		            	 	|	ВнутренняяТаблицаСклад.id КАК id,
		            	 	|	ВнутренняяТаблицаСклад.id_коробки,
		            	 	|	ВнутренняяТаблицаСклад.QR_код,
		            	 	|	ВнутренняяТаблицаСклад.GTIN,
		            	 	|	ВнутренняяТаблицаСклад.id_orders,
		            	 	|	ВнутренняяТаблицаСклад.КодСчитан,
		            	 	|	ВнутренняяТаблицаСклад.Дата_ПолученияКодов,
		            	 	|	Лео_СкладQRКоды_ВведеноВОборот.Код_КМ,
		            	 	|	ВЫБОР
		            	 	|		КОГДА ВнутренняяТаблицаСклад.QR_код = Лео_СкладQRКоды_ВведеноВОборот.Код_КМ
		            	 	|			ТОГДА ИСТИНА
		            	 	|		ИНАЧЕ ЛОЖЬ
		            	 	|	КОНЕЦ КАК КодЗагружен,
		            	 	|	ВЫБОР
		            	 	|		КОГДА ВнутренняяТаблицаСклад.id_коробки = Лео_СкладQRКоды_ВведеноВОборот.id_korob.Код
		            	 	|				ИЛИ ВнутренняяТаблицаСклад.id_коробки = 0
		            	 	|			ТОГДА ЛОЖЬ
		            	 	|		ИНАЧЕ ИСТИНА
		            	 	|	КОНЕЦ КАК КодИзменен,
		            	 	|	Лео_СкладQRКоды_ВведеноВОборот.id_korob.Код
		            	 	|ПОМЕСТИТЬ ТаблицаКодовУбрать
		            	 	|ИЗ
		            	 	|	ВнутренняяТаблицаСклад КАК ВнутренняяТаблицаСклад
		            	 	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лео_СкладQRКоды_ВведеноВОборот КАК Лео_СкладQRКоды_ВведеноВОборот
		            	 	|		ПО ВнутренняяТаблицаСклад.QR_код = Лео_СкладQRКоды_ВведеноВОборот.Код_КМ
		            	 	|;
		            	 	|
		            	 	|////////////////////////////////////////////////////////////////////////////////
		            	 	|ВЫБРАТЬ
		            	 	|	ТаблицаКодовУбрать.id КАК id,
		            	 	|	ТаблицаКодовУбрать.QR_код,
		            	 	|	ТаблицаКодовУбрать.GTIN,
		            	 	|	ТаблицаКодовУбрать.id_orders,
		            	 	|	ТаблицаКодовУбрать.Дата_ПолученияКодов,
		            	 	|	ТаблицаКодовУбрать.Код_КМ,
		            	 	|	ТаблицаКодовУбрать.КодЗагружен,
		            	 	|	ТаблицаКодовУбрать.КодИзменен,
		            	 	|	ТаблицаКодовУбрать.id_коробки,
		            	 	|	ТаблицаКодовУбрать.id_korobКод,
		            	 	|	ТаблицаКодовУбрать.КодСчитан
		            	 	|ИЗ
		            	 	|	ТаблицаКодовУбрать КАК ТаблицаКодовУбрать
		            	 	|ГДЕ
		            	 	|	ТаблицаКодовУбрать.КодИзменен
		            	 	|
		            	 	|УПОРЯДОЧИТЬ ПО
		            	 	|	id";
		//Передаем таблицу	
		Запрос.УстановитьПараметр("ТаблицаКодовЧЗ",ТаблицаКодовЧЗ);
		ВыгрузкаЗапрос	=	Запрос.Выполнить().Выгрузить();
		ВыборкаЗапрос	=	Запрос.Выполнить().Выбрать();
		ВывестиСообщение("Связка таблиц  "+ТекущаяДата());
		
		Пока ВыборкаЗапрос.Следующий() Цикл
			Если НЕ ВыборкаЗапрос.КодЗагружен Тогда
				МенеджерЗаписи = РегистрыСведений.Лео_СкладQRКоды_ВведеноВОборот.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Код_КМ 				= ВыборкаЗапрос.QR_код;
				МенеджерЗаписи.GTIN 				= Справочники.Лео_СправочникGTIN_ПодлежащихМаркировки.НайтиПоНаименованию(ВыборкаЗапрос.GTIN,Истина);
				МенеджерЗаписи.id_orders 			= ВыборкаЗапрос.id_orders;
				МенеджерЗаписи.id_korob 			= Справочники.Лео_СправочникШтрихКодовКоробок.НайтиПоКоду(ВыборкаЗапрос.id_коробки,Истина);
				МенеджерЗаписи.ДатаПолученияКодов 	= ВыборкаЗапрос.Дата_ПолученияКодов;
				МенеджерЗаписи.КодСчитан 			= ?(ВыборкаЗапрос.КодСчитан=1, Истина, Ложь);
				
				МенеджерЗаписи.Записать(); 
			Иначе			
				Если ВыборкаЗапрос.КодИзменен Тогда
					МенеджерЗаписи = РегистрыСведений.Лео_СкладQRКоды_ВведеноВОборот.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Код_КМ 				= ВыборкаЗапрос.QR_код;
					МенеджерЗаписи.Прочитать();
					Если МенеджерЗаписи.Выбран() Тогда
						МенеджерЗаписи.GTIN 				= Справочники.Лео_СправочникGTIN_ПодлежащихМаркировки.НайтиПоНаименованию(ВыборкаЗапрос.GTIN,Истина);
						МенеджерЗаписи.id_orders 			= ВыборкаЗапрос.id_orders;
						МенеджерЗаписи.id_korob 			= Справочники.Лео_СправочникШтрихКодовКоробок.НайтиПоКоду(ВыборкаЗапрос.id_коробки,Истина);
						МенеджерЗаписи.ДатаПолученияКодов 	= ВыборкаЗапрос.Дата_ПолученияКодов;
						МенеджерЗаписи.КодСчитан 			= ?(ВыборкаЗапрос.КодСчитан=1, Истина, Ложь);
						
						МенеджерЗаписи.Записать(); 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
    Исключение
        ВывестиСообщение(ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры   

Процедура ВывестиСообщение(ТекстСообщения)
	#Если Клиент Тогда
	Сообщить(ТекстСообщения);
	#КонецЕсли
КонецПроцедуры
